/**********************************************************************************************************************
【文件名】                                  assigntranslator.cpp
【功能模块和目的】                            AssignTranslator类中成员函数的实现
【开发者及日期】                             门恺文2019.7.22
【更改记录】
**********************************************************************************************************************/

#include "assigntranslator.h"

int AssignTranslator::g_iTransNum = -1;

/***********************************************************************************************************************
【函数名称】                                 AssignTranslator()
【函数功能】                                 类AssignTranslator的构造函数，在创建对象时被调用
【参数】                                    Translanguage trans, QString title, QString content, QString desc, QString startTime,
                                           QString endTime, int pncpNum,
                                           int transNum, QString pncpDDL, QString transDDL, QString trial, double reward,
                                           Status status, int id, , QString transName, int TransCode, QString CV, QString mission,
                                           int num, State state, QString feedback, QString submit，均为输入参数
【返回值】                                   无
【开发者及日期】                              门恺文 2019.7.22
【更改记录】
***********************************************************************************************************************/

AssignTranslator::AssignTranslator(Translanguage trans, QString title, QString content, QString desc, QString startTime,
                                   QString endTime, int pncpNum, int transNum, QString pncpDDL, QString transDDL,
                                   QString trial, double reward, Status status, int id, QString transName, int TransCode, QString CV, QString mission,
                                   int num, State state, QString feedback, QString submit) :Assignment(trans, title, content, desc, startTime,
                                                        endTime, pncpNum, transNum, pncpDDL,
                                                        transDDL, trial, reward, status, id)
{
    m_sMission = mission;
    m_sTransName = transName;
    m_iTransCode = TransCode;
    m_sCV = CV;
    if (num == -1)
    {
        g_iTransNum++;
        m_iTransId = g_iTransNum;
    }
    else {
        m_iTransId = num;
        if (num > g_iTransNum)
        {
            g_iTransNum = num;
        }
    }
    setITransNum(g_iTransNum + 1);
    m_sFeedback = feedback;
    m_eTransState = state;
    m_sSubmit = submit;
}

/***********************************************************************************************************************
【函数名称】                                 ~AssignTranslator()
【函数功能】                                 类AssignTranslator的析构函数，在对象被销毁时调用
【参数】                                    无
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

AssignTranslator::~AssignTranslator()
{
    //无特殊定义
}

/***********************************************************************************************************************
【函数名称】                                 sMission()
【函数功能】                                 成员m_sMission的获取函数
【参数】                                    m_sMission, QString, 输出参数
【返回值】                                   m_sMission，获取的子任务
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString AssignTranslator::sMission() const
{
    return m_sMission;
}

/***********************************************************************************************************************
【函数名称】                                 setSMission()
【函数功能】                                 成员m_sMission的设置函数
【参数】                                     sMission, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignTranslator::setSMission(const QString &sMission)
{
    m_sMission = sMission;
}

/***********************************************************************************************************************
【函数名称】                                 iTransId()
【函数功能】                                 成员m_iTransId的获取函数
【参数】                                    m_iTransId, int, 输出参数
【返回值】                                   m_iTransId，译者任务编号
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int AssignTranslator::iTransId() const
{
    return m_iTransId;
}

/***********************************************************************************************************************
【函数名称】                                 setITransId()
【函数功能】                                 成员m_iTransId的设置函数
【参数】                                    iTransId, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignTranslator::setITransId(int iTransId)
{
    m_iTransId = iTransId;
}

/***********************************************************************************************************************
【函数名称】                                 getG_iTransNum()
【函数功能】                                 成员g_iTransNum的获取函数
【参数】                                    g_iTransNum, int, 输出参数
【返回值】                                   g_iTransNum，译者总人数
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int AssignTranslator::getG_iTransNum()
{
    return g_iTransNum;
}

/***********************************************************************************************************************
【函数名称】                                 setG_iTransNum()
【函数功能】                                 成员g_iTransNum的设置函数
【参数】                                     value, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignTranslator::setG_iTransNum(int value)
{
    g_iTransNum = value;
}

/***********************************************************************************************************************
【函数名称】                                 getSTransName()
【函数功能】                                 成员m_sTransName的获取函数
【参数】                                    m_sTransName, QString, 输出参数
【返回值】                                   m_sTransName，译者姓名
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString AssignTranslator::getSTransName() const
{
    return m_sTransName;
}

/***********************************************************************************************************************
【函数名称】                                 setSTransName()
【函数功能】                                 成员m_sTransName的设置函数
【参数】                                     sTransName, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignTranslator::setSTransName(const QString &sTransName)
{
    m_sTransName = sTransName;
}

/***********************************************************************************************************************
【函数名称】                                 getITransCode()
【函数功能】                                 成员m_iTransCode的获取函数
【参数】                                    m_iTransCode, int, 输出参数
【返回值】                                   m_iTransCode，译者姓名
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int AssignTranslator::getITransCode() const
{
    return m_iTransCode;
}

/***********************************************************************************************************************
【函数名称】                                 setITransCode()
【函数功能】                                 成员m_iTransCode的设置函数
【参数】                                     iTransCode, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignTranslator::setITransCode(int iTransCode)
{
    m_iTransCode = iTransCode;
}

/***********************************************************************************************************************
【函数名称】                                 getSCV()
【函数功能】                                 成员m_sCV的获取函数
【参数】                                    m_sCV, QString, 输出参数
【返回值】                                   m_sCV，译者简历
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString AssignTranslator::getSCV() const
{
    return m_sCV;
}

/***********************************************************************************************************************
【函数名称】                                 setSCV()
【函数功能】                                 成员m_sCV的设置函数
【参数】                                     sCV, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignTranslator::setSCV(const QString &sCV)
{
    m_sCV = sCV;
}

/***********************************************************************************************************************
【函数名称】                                 getSSubmit()
【函数功能】                                 成员m_sSubmit的获取函数
【参数】                                    m_sSubmit, QString, 输出参数
【返回值】                                   m_sSubmit，译者提交的任务
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString AssignTranslator::getSSubmit() const
{
    return m_sSubmit;
}

/***********************************************************************************************************************
【函数名称】                                 setSSubmit()
【函数功能】                                 成员m_sSubmit的设置函数
【参数】                                     sSubmit, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignTranslator::setSSubmit(const QString &sSubmit)
{
    m_sSubmit = sSubmit;
}

/***********************************************************************************************************************
【函数名称】                                 getSFeedback()
【函数功能】                                 成员m_sFeedback的获取函数
【参数】                                    m_sFeedback, QString, 输出参数
【返回值】                                   m_sFeedback，译者获得的反馈
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString AssignTranslator::getSFeedback() const
{
    return m_sFeedback;
}

/***********************************************************************************************************************
【函数名称】                                 setSFeedback()
【函数功能】                                 成员m_sFeedback的设置函数
【参数】                                     sFeedback, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignTranslator::setSFeedback(const QString &sFeedback)
{
    m_sFeedback = sFeedback;
}

/***********************************************************************************************************************
【函数名称】                                 getETransState()
【函数功能】                                 成员m_eTransState的获取函数
【参数】                                    m_eTransState, State, 输出参数
【返回值】                                   m_eTransState，译者所处的状态
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

State AssignTranslator::getETransState() const
{
    return m_eTransState;
}

/***********************************************************************************************************************
【函数名称】                                 setETransState()
【函数功能】                                 成员m_eTransState的设置函数
【参数】                                     eTransState, State, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignTranslator::setETransState(const State &eTransState)
{
    m_eTransState = eTransState;
}

/***********************************************************************************************************************
【函数名称】                                 getSMission()
【函数功能】                                 成员m_sMission的获取函数
【参数】                                    m_sMission, QString, 输出参数
【返回值】                                   m_sMission，获取的子任务
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString AssignTranslator::getSMission() const
{
    return m_sMission;
}
