/***********************************************************************************************************************
【文件名】                                  assignment.cpp
【功能模块和目的】                           assignment成员函数定义和静态成员初始化
【开发者及日期】                             门恺文 2019.7.22
【更改记录】
***********************************************************************************************************************/


#include "assignment.h"

int Assignment::g_iAssignNum = -1;

/***********************************************************************************************************************
【函数名称】                                 Assignment()
【函数功能】                                 类Assignment的构造函数，在创建对象时被调用
【参数】                                    Translanguage trans, QString title, QString content, QString desc, QString startTime,
                                           QString endTime, int pncpNum,
                                           int transNum, QString pncpDDL, QString transDDL, QString trial, double reward,
                                            Status status, int id，均为输入参数
【返回值】                                   无
【开发者及日期】                              门恺文 2019.7.22
【更改记录】
***********************************************************************************************************************/

Assignment::Assignment(Translanguage trans, QString title, QString content, QString desc, QString startTime,
                       QString endTime, int pncpNum,
                       int transNum, QString pncpDDL, QString transDDL, QString trial, double reward,
                       Status status, int id) :m_tTrans(trans)
{
    m_sTitle = title;
    m_sContent = content;
    m_sDescription = desc;
    m_sStartTime = startTime;
    m_sEndTime = endTime;
    m_iPncpNum = pncpNum;
    m_iTransNum = transNum;
    m_sPncpDDL = pncpDDL;
    m_sTransDDL = transDDL;
    m_sTrial = trial;
    m_dReward = reward;
    m_tTrans = trans;
    m_eStatus = status;
    if (id == -1)
    {
        g_iAssignNum++;
        m_iAssignId = g_iAssignNum;
    }
    else {
        m_iAssignId = id;
        if (id > g_iAssignNum)
        {
            g_iAssignNum = id;
        }
    }
}

/***********************************************************************************************************************
【函数名称】                                 Assignment()
【函数功能】                                 类Assignment的拷贝构造函数
【参数】                                    const Assignment &assign，均为输入参数
【返回值】                                   无
【开发者及日期】                              门恺文 2019.7.22
【更改记录】
***********************************************************************************************************************/

Assignment::Assignment(const Assignment &assign) :m_tTrans(assign.m_tTrans)
{
    copy(assign);
}

/***********************************************************************************************************************
【函数名称】                                 ~Assignment()
【函数功能】                                 类Assignment的析构函数，在对象被销毁时调用
【参数】                                    无
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

Assignment::~Assignment()
{
    //无特别要求
}

/***********************************************************************************************************************
【函数名称】                                 operator=()
【函数功能】                                 类Assignment的重载赋值运算符
【参数】                                    const Assignment &assign，传入参数
【返回值】                                   该对象
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

Assignment &Assignment::operator=(const Assignment &assign)
{
    copy(assign);
    return *this;
}

/***********************************************************************************************************************
【函数名称】                                 getContent()
【函数功能】                                 成员m_sContent的获取函数
【参数】                                     m_sContent, QString, 输出参数
【返回值】                                   m_sContent，任务内容
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const QString &Assignment::getContent()
{
    return m_sContent;
}

/***********************************************************************************************************************
【函数名称】                                 getgetDesc()
【函数功能】                                 成员m_sDescription的获取函数
【参数】                                     m_sDescription, QString, 输出参数
【返回值】                                   m_sDescription，任务简介
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const QString &Assignment::getDesc()
{
    return m_sDescription;
}

/***********************************************************************************************************************
【函数名称】                                 getStartTime()
【函数功能】                                 成员m_sStartTime的获取函数
【参数】                                     m_sStartTime, QString, 输出参数
【返回值】                                   m_sStartTime，任务开始时间
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const QString &Assignment::getStartTime()
{
    return m_sStartTime;
}

/***********************************************************************************************************************
【函数名称】                                 getEndTime()
【函数功能】                                 成员m_sEndTime的获取函数
【参数】                                     m_sEndTime, QString, 输出参数
【返回值】                                   m_sEndTime，任务截止时间
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const QString &Assignment::getEndTime()
{
    return m_sEndTime;
}

/***********************************************************************************************************************
【函数名称】                                 getPncpNum()
【函数功能】                                 成员m_iPncpNum的获取函数
【参数】                                     m_iPncpNum, int, 输出参数
【返回值】                                   m_iPncpNum，负责人任务编号
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const int &Assignment::getPncpNum()
{
    return m_iPncpNum;
}

/***********************************************************************************************************************
【函数名称】                                 getTransNum()
【函数功能】                                 成员m_iTransNum的获取函数
【参数】                                     m_iTransNum, int, 输出参数
【返回值】                                   m_iTransNum，译者任务编号
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const int &Assignment::getTransNum()
{
    return m_iTransNum;
}

/***********************************************************************************************************************
【函数名称】                                 getPncpDDL()
【函数功能】                                 成员m_sPncpDDL的获取函数
【参数】                                     m_sPncpDDL, QString, 输出参数
【返回值】                                   m_sPncpDDL，负责人报名截止时间
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const QString &Assignment::getPncpDDL()
{
    return m_sPncpDDL;
}

/***********************************************************************************************************************
【函数名称】                                 getTransDDL()
【函数功能】                                 成员m_sTransDDL的获取函数
【参数】                                     m_sTransDDL, QString, 输出参数
【返回值】                                   m_sTransDDL，译者报名截止时间
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const QString &Assignment::getTransDDL()
{
    return m_sTransDDL;
}

/***********************************************************************************************************************
【函数名称】                                 getTrial()
【函数功能】                                 成员m_sTrial的获取函数
【参数】                                     m_sTrial, QString, 输出参数
【返回值】                                   m_sTrial，试译内容
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const QString &Assignment::getTrial()
{
    return m_sTrial;
}

/***********************************************************************************************************************
【函数名称】                                 getReward()
【函数功能】                                 成员m_dReward的获取函数
【参数】                                     m_dReward, double, 输出参数
【返回值】                                   m_dReward，酬金
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const double &Assignment::getReward()
{
    return m_dReward;
}

/***********************************************************************************************************************
【函数名称】                                 getTrans()
【函数功能】                                 成员m_tTrans的获取函数
【参数】                                     m_tTrans, Translanguage, 输出参数
【返回值】                                   m_tTrans，翻译语言
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const Translanguage &Assignment::getTrans()
{
    return m_tTrans;
}

/***********************************************************************************************************************
【函数名称】                                 getStatus()
【函数功能】                                 成员m_eStatus的获取函数
【参数】                                     m_eStatus, Status, 输出参数
【返回值】                                   m_eStatus，任务状态
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const Status &Assignment::getStatus()
{
    return m_eStatus;
}

/***********************************************************************************************************************
【函数名称】                                 getAssignId()
【函数功能】                                 成员m_iAssignId的获取函数
【参数】                                     m_iAssignId, int, 输出参数
【返回值】                                   m_iAssignId，任务编号
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

const int &Assignment::getAssignId()
{
    return m_iAssignId;
}

/***********************************************************************************************************************
【函数名称】                                 getAssignNum()
【函数功能】                                 成员g_iAssignNum的获取函数
【参数】                                     g_iAssignNum, int, 输出参数
【返回值】                                   g_iAssignNum，任务总数
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int &Assignment::getAssignNum()
{
    return g_iAssignNum;
}

/***********************************************************************************************************************
【函数名称】                                 setPncpDDL()
【函数功能】                                 成员m_sPncpDDL的设置函数
【参数】                                     m_sPncpDDL, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::setPncpDDL(const QString &pncpddl)
{
    m_sPncpDDL = pncpddl;
}

/***********************************************************************************************************************
【函数名称】                                 setTransDDL()
【函数功能】                                 成员m_sTransDDL的设置函数
【参数】                                     m_sTransDDL, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::setTransDDL(const QString &transddl)
{
    m_sTransDDL = transddl;
}

/***********************************************************************************************************************
【函数名称】                                 setReward()
【函数功能】                                 成员m_dReward的设置函数
【参数】                                     reward, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::setReward(const double &reward)
{
    m_dReward = reward;
}

/***********************************************************************************************************************
【函数名称】                                 copy()
【函数功能】                                 类的赋值，被复制构造函数、重载=运算符调用
【参数】                                     assign, Assignment, 输入参数
【返回值】                                   assign，复制对象
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::copy(const Assignment &assign)
{
    m_sTitle = assign.m_sTitle;
    m_sContent = assign.m_sContent;
    m_sDescription = assign.m_sDescription;
    m_sStartTime = assign.m_sStartTime;
    m_sEndTime = assign.m_sEndTime;
    m_iPncpNum = assign.m_iPncpNum;
    m_iTransNum = assign.m_iTransNum;
    m_sPncpDDL = assign.m_sPncpDDL;
    m_sTransDDL = assign.m_sTransDDL;
    m_sTrial = assign.m_sTrial;
    m_dReward = assign.m_dReward;
    m_tTrans = assign.m_tTrans;
    m_eStatus = assign.m_eStatus;
    m_iAssignId = assign.m_iAssignId;
    if (assign.m_iAssignId > g_iAssignNum)
    {
        g_iAssignNum = m_iAssignId;
    }
}

/***********************************************************************************************************************
【函数名称】                                 setEStatus()
【函数功能】                                 成员m_eStatus的设置函数
【参数】                                     eStatus, Status, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::setEStatus(const Status &eStatus)
{
    m_eStatus = eStatus;
}

/***********************************************************************************************************************
【函数名称】                                 getSTitle()
【函数功能】                                 成员m_sTitle的获取函数
【参数】                                     m_sTitle, QString, 输出参数
【返回值】                                   m_sTitle，任务标题
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString Assignment::getSTitle() const
{
    return m_sTitle;
}

/***********************************************************************************************************************
【函数名称】                                 setSTitle()
【函数功能】                                 成员m_sTitle的设置函数
【参数】                                     sTitle, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::setSTitle(const QString &sTitle)
{
    m_sTitle = sTitle;
}

/***********************************************************************************************************************
【函数名称】                                 setITransNum()
【函数功能】                                 成员m_iTransNum的设置函数
【参数】                                     iTransNum, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::setITransNum(int iTransNum)
{
    m_iTransNum = iTransNum;
}

/***********************************************************************************************************************
【函数名称】                                 setIPncpNum()
【函数功能】                                 成员m_iPncpNum的设置函数
【参数】                                     iPncpNum, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::setIPncpNum(int iPncpNum)
{
    m_iPncpNum = iPncpNum;
}

/***********************************************************************************************************************
【函数名称】                                 getSEndTime()
【函数功能】                                 成员m_sEndTime的获取函数
【参数】                                     m_sEndTime, QString, 输出参数
【返回值】                                   m_sEndTime，任务截止日期
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString Assignment::getSEndTime() const
{
    return m_sEndTime;
}

/***********************************************************************************************************************
【函数名称】                                 setSEndTime()
【函数功能】                                 成员m_sEndTime的设置函数
【参数】                                     sEndTime, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::setSEndTime(const QString &sEndTime)
{
    m_sEndTime = sEndTime;
}

/***********************************************************************************************************************
【函数名称】                                 getSStartTime()
【函数功能】                                 成员m_sStartTime的获取函数
【参数】                                     m_sStartTime, QString, 输出参数
【返回值】                                   m_sStartTime，任务开始日期
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString Assignment::getSStartTime() const
{
    return m_sStartTime;
}

/***********************************************************************************************************************
【函数名称】                                 setSStartTime()
【函数功能】                                 成员m_sStartTime的设置函数
【参数】                                     sStartTime, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void Assignment::setSStartTime(const QString &sStartTime)
{
    m_sStartTime = sStartTime;
}
