/**********************************************************************************************************************
【文件名】                                  assignprincipal.cpp
【功能模块和目的】                            AssignPrincipal类中成员函数的实现
【开发者及日期】                             门恺文2019.7.22
【更改记录】
**********************************************************************************************************************/

#include "assignprincipal.h"

int AssignPrincipal::g_iPncpNum = -1;

/***********************************************************************************************************************
【函数名称】                                 AssignPrincipal()
【函数功能】                                 类AssignPrincipal的构造函数，在创建对象时被调用
【参数】                                    Translanguage trans, QString title, QString content, QString desc, QString startTime,
                                           QString endTime, int pncpNum,
                                           int transNum, QString pncpDDL, QString transDDL, QString trial, double reward,
                                           Status status, int id, QString pncpName, int pncpCode,
                                           QString CV, int num, bool confirm，均为输入参数
【返回值】                                   无
【开发者及日期】                              门恺文 2019.7.22
【更改记录】
***********************************************************************************************************************/

AssignPrincipal::AssignPrincipal(Translanguage trans, QString title, QString content, QString desc, QString startTime,
                                 QString endTime, int pncpNum, int transNum, QString pncpDDL, QString transDDL,
                                 QString trial, double reward, Status status, int id, QString pncpName, int pncpCode,
                                 QString CV, int num, bool confirm) :Assignment(trans, title, content, desc, startTime,
                                                                        endTime, pncpNum, transNum, pncpDDL,
                                                                        transDDL, trial, reward, status, id)
{
    m_sPncpName = pncpName;
    m_iPncpCode = pncpCode;
    m_sCV = CV;
    if (num == -1)
    {
        g_iPncpNum++;
        m_iNum = g_iPncpNum;
    }
    else {
        m_iNum = num;
        if (num > g_iPncpNum)
        {
            g_iPncpNum = num;
        }
    }
    setIPncpNum(g_iPncpNum + 1);
    m_bIsConfirmed = confirm;
}

/***********************************************************************************************************************
【函数名称】                                 ~AssignPrincipal()
【函数功能】                                 类AssignPrincipal的析构函数，在对象被销毁时调用
【参数】                                    无
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

AssignPrincipal::~AssignPrincipal()
{
    //析构函数无特别操作
}

/***********************************************************************************************************************
【函数名称】                                 getINum()
【函数功能】                                 成员m_iNum的获取函数
【参数】                                     m_iNum, int, 输出参数
【返回值】                                   m_iNum，负责人编号
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int AssignPrincipal::getINum() const
{
    return m_iNum;
}

/***********************************************************************************************************************
【函数名称】                                 setINum()
【函数功能】                                 成员m_iNum的设置函数
【参数】                                     iNum, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignPrincipal::setINum(int iNum)
{
    m_iNum = iNum;
}

/***********************************************************************************************************************
【函数名称】                                 getG_iPncpNum()
【函数功能】                                 成员g_iPncpNum的获取函数
【参数】                                     g_iPncpNum, int, 输出参数
【返回值】                                   g_iPncpNum，负责人总人数
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int AssignPrincipal::getG_iPncpNum()
{
    return g_iPncpNum;
}

/***********************************************************************************************************************
【函数名称】                                 getSPncpName()
【函数功能】                                 成员m_sPncpName的获取函数
【参数】                                     m_sPncpName, QString, 输出参数
【返回值】                                   m_sPncpName，负责人姓名
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString AssignPrincipal::getSPncpName() const
{
    return m_sPncpName;
}

/***********************************************************************************************************************
【函数名称】                                 setSPncpName()
【函数功能】                                 成员m_sPncpName的设置函数
【参数】                                     sPncpName, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignPrincipal::setSPncpName(const QString &sPncpName)
{
    m_sPncpName = sPncpName;
}

/***********************************************************************************************************************
【函数名称】                                 getSCV()
【函数功能】                                 成员m_sCV的获取函数
【参数】                                     m_sCV, QString, 输出参数
【返回值】                                   m_sCV，负责人简历
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString AssignPrincipal::getSCV() const
{
    return m_sCV;
}

/***********************************************************************************************************************
【函数名称】                                 setSCV()
【函数功能】                                 成员m_sCV的设置函数
【参数】                                     sCV, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignPrincipal::setSCV(const QString &sCV)
{
    m_sCV = sCV;
}

/***********************************************************************************************************************
【函数名称】                                 getIPncpCode()
【函数功能】                                 成员m_iPncpCode的获取函数
【参数】                                     m_iPncpCode, int, 输出参数
【返回值】                                   m_iPncpCode，负责人用户编号
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int AssignPrincipal::getIPncpCode() const
{
    return m_iPncpCode;
}

/***********************************************************************************************************************
【函数名称】                                 setIPncpCode()
【函数功能】                                 成员m_iPncpCode的设置函数
【参数】                                     iPncpCode, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignPrincipal::setIPncpCode(int iPncpCode)
{
    m_iPncpCode = iPncpCode;
}

/***********************************************************************************************************************
【函数名称】                                 getBIsConfirmed()
【函数功能】                                 成员m_bIsConfirmed的获取函数
【参数】                                     m_bIsConfirmed, bool, 输出参数
【返回值】                                   m_bIsConfirmed，负责人状态
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

bool AssignPrincipal::getBIsConfirmed() const
{
    return m_bIsConfirmed;
}

/***********************************************************************************************************************
【函数名称】                                 setBIsConfirmed()
【函数功能】                                 成员m_bIsConfirmed的设置函数
【参数】                                     bIsConfirmed, bool, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void AssignPrincipal::setBIsConfirmed(bool bIsConfirmed)
{
    m_bIsConfirmed = bIsConfirmed;
}

