/***********************************************************************************************************************
【文件名】                                  confirmdlg.h
【模块功能和目的】                            重要操作的确认提示框，防止用户操作失误
【开发者及日期】                             门恺文2019.7.28
【更改记录】
************************************************************************************************************************/

#ifndef CONFIRMDLG_H
#define CONFIRMDLG_H

#include <QDialog>

namespace Ui {
class ConfirmDlg;
}

/************************************************************************************************************************
【类名】                                   ConfirmDlg
【功能】                                   让用户再次确认，减少用户操作失误
【接口说明】                                包含一个构造函数和一个析构函数
                                          每一个数据成员都有一对Getter和Setter函数，以提高代码可移植性，并保证数据安全
【开发者及日期】                             门恺文2019.7.28
【更改记录】
************************************************************************************************************************/

class ConfirmDlg : public QDialog
{
    Q_OBJECT

public:
    //构造和析构函数
    explicit ConfirmDlg(QWidget *parent = nullptr);
    ~ConfirmDlg();

    //确认对话框内容获取函数
    void setContent(const QString &value);

private:
    Ui::ConfirmDlg *ui;

    QString content;
};

#endif // CONFIRMDLG_H
