/***********************************************************************************************************************
【文件名】                                  confirmdlg.h
【模块功能和目的】                            重要操作的确认提示框，防止用户操作失误
【开发者及日期】                             门恺文2019.7.28
【更改记录】                                 2019.7.30 将对话框中的设置放在获取内容之后
************************************************************************************************************************/

#include "confirmdlg.h"
#include "ui_confirmdlg.h"

/***********************************************************************************************************************
【函数名称】                                 ConfirmDlg()
【函数功能】                                 类ConfirmDlg的构造函数，在创建对象时被调用
【参数】                                    QWidget *parent，输入参数
【返回值】                                   无
【开发者及日期】                              门恺文 2019.7.28
【更改记录】
***********************************************************************************************************************/

ConfirmDlg::ConfirmDlg(QWidget *parent) :
    QDialog(parent),
    ui(new Ui::ConfirmDlg)
{
    ui->setupUi(this);
}

/***********************************************************************************************************************
【函数名称】                                 ~ConfirmDlg()
【函数功能】                                 类ConfirmDlg的析构函数，在对象被销毁时调用
【参数】                                    ui
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.28
【更改记录】
***********************************************************************************************************************/

ConfirmDlg::~ConfirmDlg()
{
    delete ui;
}

/***********************************************************************************************************************
【函数名称】                                 setContent()
【函数功能】                                 成员content的设置函数
【参数】                                     value, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.28
【更改记录】
***********************************************************************************************************************/

void ConfirmDlg::setContent(const QString &value)
{
    //获取内容之后再设置对话框中的文字
    content = value;
    ui->label->setText(content);
}
