/************************************************************************************************************************
【文件名】                                  contrast.h
【模块功能和目的】                           Contrast类声明，译者和负责人提交报名之前需要先看并且勾选的
【开发者及日期】                             门恺文 2019.7.25
【更改记录】
************************************************************************************************************************/

#ifndef CONTRASTDLG_H
#define CONTRASTDLG_H

#include <QDialog>

namespace Ui {
class ContrastDlg;
}

/************************************************************************************************************************
【类名】                                   ContrastDlg
【功能】                                   封装用户成功报名负责人或译者前需要同意的译者协议
【接口说明】                                包含一个构造函数和一个析构函数
【开发者及日期】                             门恺文2019.7.25
【更改记录】
************************************************************************************************************************/

class ContrastDlg : public QDialog
{
    Q_OBJECT

public:
    //构造和析构函数
    explicit ContrastDlg(QWidget *parent = nullptr);
    ~ContrastDlg();

private:
    Ui::ContrastDlg *ui;
};

#endif // CONTRASTDLG_H
