/**********************************************************************************************************************
【文件名】                                  contrastdlg.cpp
【功能模块和目的】                            ContrastDlg类的实现
【开发者及日期】                             门恺文2019.7.27
【更改记录】
**********************************************************************************************************************/

#include "contrastdlg.h"
#include "ui_contrastdlg.h"

/***********************************************************************************************************************
【函数名称】                                 ContrastDlg()
【函数功能】                                 类ContrastDlg的构造函数，在创建对象时被调用
【参数】                                    QWidget *parent，输入参数
【返回值】                                   无
【开发者及日期】                              门恺文 2019.7.27
【更改记录】
***********************************************************************************************************************/

ContrastDlg::ContrastDlg(QWidget *parent) :
    QDialog(parent),
    ui(new Ui::ContrastDlg)
{
    ui->setupUi(this);
    ui->plainTextEdit->isReadOnly();
}

/***********************************************************************************************************************
【函数名称】                                 ~ContrastDlg()
【函数功能】                                 类ContrastDlg的析构函数，在对象被销毁时调用
【参数】                                    ui
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.27
【更改记录】
***********************************************************************************************************************/

ContrastDlg::~ContrastDlg()
{
    delete ui;
}
