/**********************************************************************************************************************
【文件名】                                  pncpassigndlg.cpp
【功能模块和目的】                            PncpAssignDlg类中成员函数的实现, 包括槽函数、接口函数,页面设置
【开发者及日期】                             门恺文2019.7.27
【更改记录】
**********************************************************************************************************************/

#include "pncpassigndlg.h"
#include "ui_pncpassigndlg.h"
#include "confirmdlg.h"

/***********************************************************************************************************************
【函数名称】                                 PncpAssignDlg()
【函数功能】                                 类PncpAssignDlg的构造函数
【参数】                                     QWidget *parent，输入参数
【返回值】                                   无
【开发者及日期】                              门恺文 2019.7.27
【更改记录】
***********************************************************************************************************************/

PncpAssignDlg::PncpAssignDlg(QWidget *parent) :
    QDialog(parent),
    ui(new Ui::PncpAssignDlg)
{
    ui->setupUi(this);
    ui->labFront->setText(front);
}

/***********************************************************************************************************************
【函数名称】                                 ~PncpAssignDlg()
【函数功能】                                 类PncpAssignDlg的析构函数，在对象被销毁时调用
【参数】                                    ui
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.27
【更改记录】
***********************************************************************************************************************/

PncpAssignDlg::~PncpAssignDlg()
{
    delete ui;
}

/***********************************************************************************************************************
【函数名称】                                 setFront()
【函数功能】                                 成员front的设置函数
【参数】                                     value, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.27
【更改记录】
***********************************************************************************************************************/

void PncpAssignDlg::setFront(const QString &value)
{
    front = value;
}

/***********************************************************************************************************************
【函数名称】                                 setTransId()
【函数功能】                                 成员transId的设置函数
【参数】                                     value, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.27
【更改记录】
***********************************************************************************************************************/

void PncpAssignDlg::setTransId(int value)
{
    transId = value;
}

/***********************************************************************************************************************
【函数名称】                                 setTransCode()
【函数功能】                                 成员transCode的设置函数
【参数】                                     value, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.27
【更改记录】
***********************************************************************************************************************/

void PncpAssignDlg::setTransCode(int value)
{
    transCode = value;
}

/***********************************************************************************************************************
【函数名称】                                 on_confirmBtn_clicked()
【函数功能】                                 分配子任务的槽函数
【参数】                                     无
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.27
【更改记录】
***********************************************************************************************************************/

void PncpAssignDlg::on_confirmBtn_clicked()
{
    QString mission = ui->plainTextEdit->toPlainText();
    //子任务不得为空
    if (mission.isEmpty())
    {
        QMessageBox::warning(this, "warning", tr("请输入该译者子任务"), QMessageBox::Ok);
        return;
    }
    //再次确认
    ConfirmDlg dlg;
    QString front = tr("是否确认分配该子任务？");
    dlg.setContent(front);
    if (dlg.exec() == QDialog::Accepted)
    {
        //译者状态改变
        transList[transId].setETransState(TRANSLATING);
        transList[transId].setSMission(mission);
        QMessageBox::information(this,tr("通知"), tr("子任务已分配"));
        //向译者发消息
        MsgBox msg(transCode, pncpCode, tr("任务查收通知"), tr("您所翻译的任务")+QString::number(assignId) + tr("：")
                   +transList[transId].getSTitle()+tr("，负责人已分配子任务，请及时翻译"));
        msgList.push_back(msg);
        accept();
    }
}

/***********************************************************************************************************************
【函数名称】                                 setAssignId()
【函数功能】                                 成员assignId的设置函数
【参数】                                     value, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.27
【更改记录】
***********************************************************************************************************************/

void PncpAssignDlg::setAssignId(int value)
{
    assignId = value;
}

/***********************************************************************************************************************
【函数名称】                                 setPncpCode()
【函数功能】                                 成员pncpCode的设置函数
【参数】                                     value, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.27
【更改记录】
***********************************************************************************************************************/

void PncpAssignDlg::setPncpCode(int value)
{
    pncpCode = value;
}
