/**********************************************************************************************************************
【文件名】                                  user.cpp
【功能模块和目的】                            User类中成员函数的实现
【开发者及日期】                             门恺文2019.7.22
【更改记录】
**********************************************************************************************************************/

#include "user.h"

int User::g_iUserNum = -1;

/***********************************************************************************************************************
【函数名称】                                 User()
【函数功能】                                 类User的构造函数
【参数】                                    int code, QString username, QString password, QString mobilePhone,
                                           QString languageLevel, QString name, QString email, QString id,
                                           double balance, int point, QString avatar，输入参数
【返回值】                                   无
【开发者及日期】                              门恺文 2019.7.22
【更改记录】
***********************************************************************************************************************/

User::User(int code, QString username, QString password, QString mobilePhone,
           QString languageLevel, QString name, QString email, QString id,
           double balance, int point, QString avatar) :Person (name, mobilePhone, email, id)
{
    if (code == -1)
    {
        g_iUserNum++;
        m_iCode = g_iUserNum;
    }
    else {
        m_iCode = code;
        if (code > g_iUserNum)
        {
            g_iUserNum = code;
        }
    }
    m_sLanguageLevel = languageLevel;
    if (point == -1)
    {
        m_iPoints = 0;
        int len = languageLevel.size();
        while (len != 0)
        {
            if (!languageLevel.contains("。"))
            {
                m_iPoints++;
                break;
            }
            int N = languageLevel.indexOf("。");
            //m_sLanguageLevel.append(languageLevel.left(N));
            len = len - N - 1;
            languageLevel = languageLevel.right(len);
            m_iPoints++;
        }
    }
    else {
        m_iPoints = point;
    }
    m_sUsername = username;
    m_sPassword = password;
    m_dBalance = balance;
    m_sAvatar = avatar;
}

/***********************************************************************************************************************
【函数名称】                                 User()
【函数功能】                                 类User的复制构造函数
【参数】                                    const User &user，输入参数
【返回值】                                   无
【开发者及日期】                              门恺文 2019.7.22
【更改记录】
***********************************************************************************************************************/

User::User(const User &user) :Person(user)
{
    m_iCode = user.m_iCode;
    m_sLanguageLevel = user.m_sLanguageLevel;
    m_sUsername = user.m_sUsername;
    m_sPassword = user.m_sPassword;
    m_dBalance = user.m_dBalance;
    m_iPoints = user.m_iPoints;
    m_sAvatar = user.m_sAvatar;
}

/***********************************************************************************************************************
【函数名称】                                 ~Translanguage()
【函数功能】                                 类Translanguage的析构函数，在对象被销毁时调用
【参数】                                    ui
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

User::~User()
{
    //直接析构
}

/***********************************************************************************************************************
【函数名称】                                 operator=()
【函数功能】                                 类User的重载赋值运算符
【参数】                                    const User &user，输入参数
【返回值】                                   该对象
【开发者及日期】                              门恺文 2019.7.22
【更改记录】
***********************************************************************************************************************/

User &User::operator=(const User &user)
{
    m_iCode = user.m_iCode;
    m_sLanguageLevel = user.m_sLanguageLevel;
    m_sUsername = user.m_sUsername;
    m_sPassword = user.m_sPassword;
    m_dBalance = user.m_dBalance;
    m_iPoints = user.m_iPoints;
    m_sAvatar = user.m_sAvatar;
    return *this;
}

/***********************************************************************************************************************
【函数名称】                                 addLevel()
【函数功能】                                 增加语言水平
【参数】                                     level, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::addLevel(const QString &level)
{
    m_sLanguageLevel.push_back(level);
}

/***********************************************************************************************************************
【函数名称】                                 setUsername()
【函数功能】                                 成员Username的设置函数
【参数】                                     Username, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::setUserName(const QString &username)
{
    m_sUsername = username;
}

/***********************************************************************************************************************
【函数名称】                                 setPassword()
【函数功能】                                 成员Password的设置函数
【参数】                                     Password, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::setPassword(const QString &password)
{
    m_sPassword = password;
}

/***********************************************************************************************************************
【函数名称】                                 setBalance()
【函数功能】                                 成员Balance的设置函数
【参数】                                     Balance, double, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::setBalance(const double &balance)
{
    m_dBalance = balance;
}

/***********************************************************************************************************************
【函数名称】                                 setPoint()
【函数功能】                                 成员Point的设置函数
【参数】                                     Point, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::setPoint(const int &point)
{
    m_iPoints = point;
}

/***********************************************************************************************************************
【函数名称】                                 getUserName()
【函数功能】                                 成员m_sUsername的获取函数
【参数】                                    m_sUsername, QString, 输出参数
【返回值】                                   m_sUsername，用户名
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString &User::getUserName()
{
    return m_sUsername;
}

/***********************************************************************************************************************
【函数名称】                                 getPassword()
【函数功能】                                 成员m_sPassword的获取函数
【参数】                                    m_sPassword, QString, 输出参数
【返回值】                                   m_sPassword，密码
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString &User::getPassword()
{
    return m_sPassword;
}

/***********************************************************************************************************************
【函数名称】                                 getBalance()
【函数功能】                                 成员m_dBalance的获取函数
【参数】                                    m_dBalance, double, 输出参数
【返回值】                                   m_dBalance，余额
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

double &User::getBalance()
{
    return m_dBalance;
}

/***********************************************************************************************************************
【函数名称】                                 getPoint()
【函数功能】                                 成员m_iPoints的获取函数
【参数】                                    m_iPoints, int, 输出参数
【返回值】                                   m_iPoints，积分
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int &User::getPoint()
{
    return m_iPoints;
}

/***********************************************************************************************************************
【函数名称】                                 getSPassword()
【函数功能】                                 成员m_sPassword的获取函数
【参数】                                    m_sPassword, QString, 输出参数
【返回值】                                   m_sPassword，密码
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString User::getSPassword() const
{
    return m_sPassword;
}

/***********************************************************************************************************************
【函数名称】                                 setSPassword()
【函数功能】                                 成员Password的设置函数
【参数】                                     Password, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::setSPassword(const QString &sPassword)
{
    m_sPassword = sPassword;
}

/***********************************************************************************************************************
【函数名称】                                 getUserNum()
【函数功能】                                 成员g_iUserNum的获取函数
【参数】                                    g_iUserNum, int, 输出参数
【返回值】                                   g_iUserNum，用户总人数
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int User::getUserNum()
{
    return g_iUserNum;
}

/***********************************************************************************************************************
【函数名称】                                 setUserNum()
【函数功能】                                 成员g_iUserNum的设置函数
【参数】                                     g_iUserNum, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::setUserNum(int value)
{
    g_iUserNum = value;
}

/***********************************************************************************************************************
【函数名称】                                 getICode()
【函数功能】                                 成员m_iCode的获取函数
【参数】                                    m_iCode, int, 输出参数
【返回值】                                   m_iCode，用户总人数
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

int User::getICode() const
{
    return m_iCode;
}

/***********************************************************************************************************************
【函数名称】                                 setICode()
【函数功能】                                 成员m_iCodem的设置函数
【参数】                                     iCode, int, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::setICode(int iCode)
{
    m_iCode = iCode;
}

/***********************************************************************************************************************
【函数名称】                                 getSAvatar()
【函数功能】                                 成员m_sAvatar的获取函数
【参数】                                    m_sAvatar, QString, 输出参数
【返回值】                                   m_sAvatar，头像
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString User::getSAvatar() const
{
    return m_sAvatar;
}

/***********************************************************************************************************************
【函数名称】                                 setSAvatar()
【函数功能】                                 成员m_sAvatar的设置函数
【参数】                                     m_sAvatar, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::setSAvatar(const QString &sAvatar)
{
    m_sAvatar = sAvatar;
}

/***********************************************************************************************************************
【函数名称】                                 getSLanguageLevel()
【函数功能】                                 成员m_sLanguageLevel的获取函数
【参数】                                    m_sLanguageLevel, QString, 输出参数
【返回值】                                   m_sLanguageLevel，头像
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

QString User::getSLanguageLevel() const
{
    return m_sLanguageLevel;
}

/***********************************************************************************************************************
【函数名称】                                 setSLanguageLevel()
【函数功能】                                 成员m_sLanguageLevel的设置函数
【参数】                                     m_sLanguageLevel, QString, 输入参数
【返回值】                                   无
【开发者及日期】                              门恺文2019.7.22
【更改记录】
***********************************************************************************************************************/

void User::setSLanguageLevel(const QString &sLanguageLevel)
{
    m_sLanguageLevel = sLanguageLevel;
}
